Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/health_and_safety/safe_pass.html.txt.tmx
Source language: en
Languages: ga

source: • Paying for the course
ga: • Íoc as an chúrsa

source: Safe Pass is a safety awareness training programme for construction workers
ga: Is Pas Sábháilte é clár oiliúna maidir le feasacht sábháilteachta d’oibrithe fhoirgníochta

source: It is a one-day programme to enable them to work on construction sites without being a risk to themselves or others
ga: Is clár aon-lae é chun go mbeidh siad in ann obair a dhéanamh ar shuímh fhoirgníochta agus gan a bheith ina gcúis chontúirte dóibh féin ná do dhaoine eile a mbeadh tionchar ag a ngníomhartha orthu

source: Employers are required by law to ensure that employees on construction sites carry Safe Pass cards
ga: Tá dualgas dlíthiúil ar fhostóirí déanamh cinnte go bhfuil cárta Pas Sábháilte ag gach fostaí ar shuímh fhoirgníochta

source: As a result, employers must ensure that all employees are properly trained
ga: Mar sin, ní mór d’fhostóirí a chinntiú go bhfuil a gcuid fostaithe go léir traenáilte i gceart

source: The Safe Pass programme is operated and managed by SOLAS and aims to:
ga: Tá an chlár um Phas Sábháilte á feidhmiu agus á bainistiú ag SOLAS agus tá sé mar aidhm:

source: • Raise the standard of safety awareness in the construction industry
ga: • Feabhas a chur ar chaighdeáin feasachta maidir le cúrsaí sábháilteachta sa tionscal foirgníochta;

source: • Ensure that all construction site workers undergo basic health and safety awareness training with the view to making a positive contribution to the prevention of accidents and avoidance of health hazards
ga: • A chinntiú go bhfaigheann oibrithe uilig ar shuímh fhoirgníochta bunoiliúint sláinte agus sábháilteachta chun seachaint timpistí agus contúirtí sláinte a chur chun cinn;

source: • Maintain a register of construction site and local authority workers who have received such health and safety training
ga: • Clár a choinneáil d'oibrithe foirgníochta agus de na húdaráis áitiúla a bhfuil an oiliúint sláinte agus sábhailteachta sin faighte acu

source: • Provide all Safe Pass participants with a Safe Pass registration card that will indicate that the holders have attended a formal course in health and safety awareness
ga: • Cárta cláraithe a sholáthar do rannpháirtithe ar fad an chláir um Phas Shábháilte a thugann le fios go bhfuil cúrsa foirmeálta oiliúna sa tsláinte agus sábháilteachta curtha i gcrích ag na sealbhóirí

source: All workers in the construction sector, including apprentices, trainees and on-site security workers, must have received safety awareness training and have a Safe Pass registration card before they can work on construction sites
ga: Ní foláir d'oibrithe ar fad san earnáil fhoirgníochta, printisigh, daoine faoi oiliúint agus oibrithe slándála láithreáin, oiliúint feasachta sábhailteachta a fháil agus cárta cláraithe um Pas Sábháilte a bheith acu, sula dtosaíonn siad ag obair ar shuíomh foirgníochta

source: Every contractor (or other person working on their behalf) is required by law to ensure that everyone under their direct control on a construction site has received Safe Pass training and has been issued with a current Safe Pass registration card
ga: De réir an dlí ní mór do gach conraitheoir (nó duine eile ag feidhmiú ar a s(h)on) a chinntiú go bhfuair gach duine faoina smacht díreach ar shuíomh foirgníochta traenáil don Phas Sábháilte agus gur eisíodh cárta cláraithe reatha dó/di mar a sonraíodh thuas

source: Under health and safety legislation, employers are required to allow their employees paid time off from work to attend safety awareness training
ga: Faoin reachtaíocht sláinte agus sábháilte, ní mór d’fhostóirí a bhfostaithe saoire ón obair íoctha a cheadú chun oiliúint feasachta sábháilteachta a freastal

source: There are FAQs about the Safe Pass programme on the Health and Safety Authority website
ga: Tá liosta ceisteanna coitianta faoin gclár um Pas Sábháilte ar fáil ar shuíomh gréasáin an Údaráis Sláinte agus Sábháilteachta

source: Safe Pass registration cards
ga: Cártaí cláraithe an Phas Shábháilte

source: You will be issued with a Safe Pass registration card once you successfully complete the one-day Safe Pass training programme
ga: Eiseofar cárta cláraithe an Phas Shábháilte duit nuair a éiríonn leat i gclár oiliúna aon-lae an Phas Shábháilte

source: This card lasts for 4 years from the date of the training course
ga: Maireann an cárta seo ar feadh 4 bliana ó dháta an chúrsa traenála

source: If you later leave the workplace, you can still keep your registration card, provided it is in date
ga: Má fhágann tú an obair níos deireanaí, is féidir leat do chárta cláraithe a choinneáil, má tá sé fós reatha

source: When it expires, you must then attend a further Safe Pass training course
ga: Beidh ort cúrsa eile don Phas Sábháilte a dhéanamh nuair a théann do chárta in éag

source: It is illegal to forge or alter a registration card or to make any other card that resembles a registration card
ga: Tá sé in aghaidh an dlí cárta cláraithe a fhalsú nó a athrú nó cárta a dhéanamh atá cosúil le cárta cláraithe

source: All of the personal details on your registration card must be accurate and it is illegal for you to provide false information to SOLAS
ga: Caithfidh na sonraí pearsanta uile ar do chárta cláraithe a bheith cruinn agus tá sé in aghaidh an dlí eolas bréige a sholáthar do SOLAS

source: Content of the Safe Pass programme
ga: Ábhar an chláir um Pas Sábháilte

source: The training modules in the Safe Pass programme are:
ga: Is iad seo a leanas modúil oiliúna an chláir um Pas Sábháilte:

source: • Promoting a safety culture
ga: • Cultúr sábháilteachta a chur chun cinn

source: • Duties and responsibilities at work
ga: • Dualgais agus freagrachtaí ar obair

source: • Accident reporting and prevention
ga: • Timpiste a thuairisciú agus seachaint timpistí;

source: • Working with electricity, underground and overhead services
ga: • Ag obair in airde;

source: • Use of hand held equipment and tools
ga: • Úsáid trealamh láimhe agus uirlisí;

source: Safe Pass tutor accreditation
ga: Creidiúnú mar theagascóir don Phas Sábháilte

source: Prospective Safe Pass tutors must have a recognised training or education qualification and meet certain criteria (pdf)
ga: Caithfidh teagascóirí-le-bheith cáilíocht oiliúna nó oideachais aitheanta a bheith acu agus ní mór dóibh critéir áirithe (pdf) a chomhlíonadh

source: Priority will be given to candidates who can demonstrate that they can deliver the Safe Pass Programme on a regular basis
ga: Tabharfar tús áite d'iarrthóirí atá in ann a thaispeáint go mbeidh siad in ann Clár um Phas Sábháilte a sholáthar go rialta

source: Paying for the course
ga: Íoc as an chúrsa

source: Generally the employer pays for the Safe Pass course
ga: De ghnáth, is é an fostaitheoir a íocann táille an chúrsa

source: Under the Safety, Health and Welfare at Work Act, 2005, the employer must allow employees time off from their duties for awareness training as may be reasonable having regard to their health and safety without loss of pay
ga: Faoin Acht um Shábháilteacht, Sláinte agus Leas ag an Obair 2005, ní mór don fhostóir saoire óna ndualgais a cheadú chun oiliúint feasachta réasúnta le haghaidh a sláinte agus sábháilteacht a fháil gan caillteanas pá

source: Your employer cannot require you to reimburse them for the cost of the course if you subsequently leave your job, (unless you have signed something in your contract of employment stating you will reimburse any training fees incurred before you have given a certain period of service)
ga: Ní féidir le d'fhostóir iarraidh ort costas an chúrsa a aisíoc leis má éiríonn tú as do phost ina dhiaidh sin. Níl ach eisceacht amháin leis sin sa chás gur shínigh tú mír i do chonradh fostaíochta ag rá go n-aisíocfadh tú táillí traenála dá n-imeodh tú roimh tréimshe áirithe seirbhíse a bheith déanta agat

source: If you are currently unemployed, have got a job on a construction site but are required to have a Safe Pass Card before you start work, your local employment services office may be able to help with the fee
ga: Má tá tú dífhostaithe faoi láthair agus post faighte agat ar shuíomh tógála agus cárta an Pas Shábháilte de dhíth ort sula dtosaíonn tú ar an obair, b'fhéidir go mbeadh d'oifig seirbhísí fostaíochta áitiúil in ann cúnamh a thabhairt duit leis an táille a íoc

source: Employers, trainers or individuals wishing to participate in the Safe Pass Programme may apply by contacting an approved Safe Pass tutor on the register of Safe Pass Accredited Tutors
ga: Is féidir le fostóirí, oiliúnaithe nó daoine aonair atá ag iarraidh bheith páirteach sa chlár Pas Shábháilte iarratas a dhéanamh ach teagmháil a dhéanamh le teagascóir Pas Shábháilte faofa ar an gclár de Theagascóirí Creidiúnaithe Pas Shábháilte

source: If you are looking for accreditation as a Safe Pass tutor you should apply with a copy of all relevant construction, safety and training qualifications on the Safe Pass tutor application form (pdf)
ga: Má tá tú ar lorg creidiúnachta mar theagascóir Pas Shábháilte ba cheart duit iarratas a dhéanamh cóip de na cáilíochtaí ábhartha tógála, sábháilteachta agus oiliúna go léir ar an bhfoirm iarratais le haghaidh teagascóra Pas Shábháilte (pdf)

source: Contact your local employment services office or Intreo centre
ga: Déan teagmháil le d'oifig seirbhísí fostaíochta áitiúil nó ionad Intreo
